# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# runs/train/floor_source_CoT/weights/best.pt
#                 all        186        531      0.735      0.818      0.786      0.353
#    white-impurities        186        436      0.685      0.821      0.816      0.323
#          black-spot        186         40      0.703      0.875      0.827      0.341
#         edge-damage        186         24      0.653      0.706      0.616      0.212
#          bubble-gum        186         31        0.9      0.871      0.886      0.534
#Speed: 2.0ms pre-process, 14.2ms inference, 18.5ms NMS per image at shape (34, 3, 768, 768)
# runs/train/floor_source_CoT9/weights/best.pt
#                 all        186        531      0.716      0.836      0.795      0.364
#    white-impurities        186        436      0.658      0.831      0.823      0.333
#          black-spot        186         40      0.681      0.875      0.808      0.357
#         edge-damage        186         24       0.69      0.833      0.703      0.239
#          bubble-gum        186         31      0.833      0.806      0.845      0.525
#Speed: 0.3ms pre-process, 4.9ms inference, 2.4ms NMS per image at shape (34, 3, 768, 768)
# Model Summary: 252 layers, 10044017 parameters, 0 gradients, 21.315994 GFLOPs
# Parameters
nc: 4  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)
   [ -1, 1, CoTAttention, [ 256 ] ], # 18

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 21 (P4/16-medium)
   [ -1, 1, CoTAttention, [ 512 ] ],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 25 (P5/32-large)
   [ -1, 1, CoTAttention, [ 1024 ] ],

   [[18, 22, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
