# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# Model Summary: 241 layers, 6416657 parameters, 0 gradients, 15.363321 GFLOPs
# runs/train/floor_source_ResNet2/weights/best.pt
#               Class     Images     Labels          P          R     mAP@.5 mAP@.5:.95: 100%|██████████| 6/6 [00:08<00:00,  1.45s/it]
#                 all        186        531      0.693      0.777      0.771      0.341
#    white-impurities        186        436      0.735      0.784      0.827      0.349
#          black-spot        186         40      0.644      0.875      0.825      0.329
#         edge-damage        186         24      0.601      0.708      0.605      0.211
#          bubble-gum        186         31      0.793      0.742      0.826      0.475
#Speed: 0.3ms pre-process, 4.2ms inference, 3.1ms NMS per image at shape (34, 3, 768, 768)
# runs/train/floor_source_ResNet/weights/best.pt   0.801      0.327
# Model Summary: 241 layers, 6416657 parameters, 0 gradients, 15.4 GFLOPs
# Parameters
nc: 4  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3_ResNet, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3_ResNet, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3_ResNet, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3_ResNet, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3_ResNet, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3_ResNet, [256, False]],  # 17 (P3/8-small)
#   [ -1, 1, CoTAttention, [ 256 ] ], # 18

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3_ResNet, [512, False]],  # 21 (P4/16-medium)
#   [ -1, 1, CoTAttention, [ 512 ] ],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3_ResNet, [1024, False]],  # 25 (P5/32-large)
#   [ -1, 1, CoTAttention, [ 1024 ] ],

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
