# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# runs/train/bottle_source_SE/weights/best.pt
# Model Summary: 209 layers, 6938791 parameters, 0 gradients, 15.407041 GFLOPs
#                 all        335        601      0.769      0.785      0.782      0.497
#                   0        335        182       0.72      0.709      0.674      0.309
#                   1        335         71      0.839      0.746      0.805      0.437
#                   2        335         66        0.6      0.681      0.679      0.217
#                   3        335         45      0.968          1      0.995      0.865
#                   4        335         54      0.783      0.833      0.832      0.308
#                   5        335         18      0.883      0.837      0.912      0.817
#                   6        335         43        0.5      0.651      0.565      0.262
#                   7        335         50      0.554      0.521      0.476      0.204
#                   8        335         48      0.944      0.958      0.959      0.776
#                   9        335         24      0.896      0.917      0.923      0.778
#Speed: 2.0ms pre-process, 12.4ms inference, 1.6ms NMS per image at shape (34, 3, 768, 768)
# Parameters
nc: 5  # number of classes 0.773      0.343
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3_SE, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3_SE, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
