# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# Model Summary: 280 layers, 9455943 parameters, 0 gradients, 20.895744 GFLOPs
# runs/train/bottle_source_ResNet_CoT7/weights/best.pt
#                 all        335        601      0.813       0.75      0.785      0.496
#                   0        335        182      0.775      0.681      0.692       0.29
#                   1        335         71      0.802      0.761      0.796      0.417
#                   2        335         66      0.757      0.667      0.745      0.232
#                   3        335         45      0.986          1      0.995      0.848
#                   4        335         54      0.811      0.778       0.83      0.321
#                   5        335         18      0.844      0.833       0.92      0.835
#                   6        335         43      0.699      0.488      0.625      0.296
#                   7        335         50       0.57        0.4       0.35      0.143
#                   8        335         48      0.954      0.979      0.985       0.77
#                   9        335         24      0.936      0.917      0.916      0.806
#Speed: 2.0ms pre-process, 14.0ms inference, 1.0ms NMS per image at shape (34, 3, 768, 768)

# runs/train/bottle_source_ResNet_CoT/weights/best.pt

#                 all        335        601      0.809       0.74      0.776      0.494
#                   0        335        182      0.692      0.621      0.639      0.268
#                   1        335         71      0.801      0.679       0.75      0.405
#                   2        335         66      0.703      0.609      0.712      0.234
#                   3        335         45       0.96          1      0.995      0.865
#                   4        335         54      0.823      0.815      0.857      0.337
#                   5        335         18      0.894      0.944      0.927      0.841
#                   6        335         43      0.857      0.557      0.648      0.295
#                   7        335         50      0.521        0.3       0.33      0.147
#                   8        335         48      0.907      0.958       0.98      0.764
#                   9        335         24      0.931      0.917      0.922      0.788
#Speed: 0.2ms pre-process, 5.6ms inference, 1.2ms NMS per image at shape (34, 3, 768, 768)
#runs/train/bottle_source_ResNet_CoT2/weights/best.pt
#                 all        335        601      0.761      0.753      0.763       0.49
#                   0        335        182      0.768      0.681      0.663      0.273
#                   1        335         71      0.841      0.746      0.801      0.437
#                   2        335         66       0.67      0.606      0.663      0.244
#                   3        335         45      0.969          1      0.995      0.862
#                   4        335         54      0.836      0.849      0.862       0.35
#                   5        335         18      0.726      0.833      0.865      0.783
#                   6        335         43      0.598      0.622      0.625      0.277
#                   7        335         50      0.371       0.32      0.272      0.127
#                   8        335         48      0.939      0.957      0.977      0.763
#                   9        335         24      0.894      0.917      0.911      0.789
# Parameters
nc: 4  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3_ResNet, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3_ResNet, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3_ResNet, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3_ResNet, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3_ResNet, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3_ResNet, [256, False]],  # 17 (P3/8-small)
   [ -1, 1, CoTAttention, [ 256 ] ], # 18

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3_ResNet, [512, False]],  # 21 (P4/16-medium)
   [ -1, 1, CoTAttention, [ 512 ] ],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3_ResNet, [1024, False]],  # 25 (P5/32-large)
   [ -1, 1, CoTAttention, [ 1024 ] ],

   [[18, 22, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
