# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# Model Summary: 286 layers, 9464407 parameters, 0 gradients, 20.967578 GFLOPs
# runs/train/bottle_source_ResNet_SE_CoT7/weights/best.pt
#Class     Images     Labels          P          R     mAP@.5 mAP@.5:.95: 100%|██████████| 10/10 [00:12<00:00,  1.24s/it]
#                 all        335        601      0.808      0.768      0.797      0.503
#                   0        335        182       0.75      0.676      0.689      0.318
#                   1        335         71      0.854      0.741      0.828      0.427
#                   2        335         66      0.729      0.667       0.72      0.247
#                   3        335         45      0.965          1      0.995      0.853
#                   4        335         54      0.809      0.785      0.808      0.319
#                   5        335         18      0.706      0.833      0.882      0.803
#                   6        335         43      0.673      0.623      0.668      0.314
#                   7        335         50      0.709        0.5      0.476      0.195
#                   8        335         48      0.929      0.958      0.984      0.768
#                   9        335         24      0.956        0.9      0.925      0.789
#Speed: 0.2ms pre-process, 5.6ms inference, 8.0ms NMS per image at shape (34, 3, 768, 768)
# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3_ResNet, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3_ResNet, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3_ResNet, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3_ResNet_SE, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3_ResNet_SE, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3_ResNet, [256, False]],  # 17 (P3/8-small)
   [ -1, 1, CoTAttention, [ 256 ] ], # 18

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3_ResNet, [512, False]],  # 21 (P4/16-medium)
   [ -1, 1, CoTAttention, [ 512 ] ],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3_ResNet, [1024, False]],  # 25 (P5/32-large)
   [ -1, 1, CoTAttention, [ 1024 ] ],

   [[18, 22, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
