# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# Model Summary: 241 layers, 6432839 parameters, 0 gradients, 15.415233 GFLOPs
# runs/train/bottle_source_ResNet/weights/best.pt
# Class     Images     Labels          P          R     mAP@.5 mAP@.5:.95: 100%|█████████████████████████████████████████████████████| 10/10 [00:10<00:00,  1.04s/it]
#                 all        335        601      0.791      0.737      0.755      0.483
#                   0        335        182      0.687      0.681      0.685      0.277
#                   1        335         71      0.806      0.746      0.809      0.424
#                   2        335         66      0.758      0.606      0.675      0.242
#                   3        335         45          1      0.993      0.995      0.867
#                   4        335         54      0.821      0.815      0.842      0.335
#                   5        335         18      0.769      0.924       0.92      0.802
#                   6        335         43      0.645      0.465      0.472      0.203
#                   7        335         50      0.565       0.26      0.249      0.098
#                   8        335         48      0.925      0.958      0.964      0.773
#                   9        335         24      0.933      0.917      0.936      0.813
#Speed: 0.2ms pre-process, 5.4ms inference, 1.6ms NMS per image at shape (34, 3, 768, 768)
# runs/train/bottle_source_ResNet2/weights/best.pt
#               Class     Images     Labels          P          R     mAP@.5 mAP@.5:.95: 100%|█████████████████████████████████████████████████████| 10/10 [00:10<00:00,  1.09s/it]
#                 all        335        601      0.792      0.726       0.75      0.476
#                   0        335        182      0.715      0.676      0.687       0.28
#                   1        335         71      0.806      0.746      0.808      0.415
#                   2        335         66      0.775      0.626      0.713      0.238
#                   3        335         45          1      0.987      0.995      0.863
#                   4        335         54      0.776      0.778      0.786      0.319
#                   5        335         18      0.842      0.886       0.91      0.804
#                   6        335         43      0.638      0.442      0.454      0.186
#                   7        335         50      0.531       0.24      0.252     0.0952
#                   8        335         48      0.917      0.958      0.959      0.774
#                   9        335         24      0.919      0.917      0.936      0.789
#Speed: 0.2ms pre-process, 3.7ms inference, 3.5ms NMS per image at shape (34, 3, 768, 768)

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3_ResNet, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3_ResNet, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3_ResNet, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3_ResNet, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3_ResNet, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3_ResNet, [256, False]],  # 17 (P3/8-small)
#   [ -1, 1, CoTAttention, [ 256 ] ], # 18

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3_ResNet, [512, False]],  # 21 (P4/16-medium)
#   [ -1, 1, CoTAttention, [ 512 ] ],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3_ResNet, [1024, False]],  # 25 (P5/32-large)
#   [ -1, 1, CoTAttention, [ 1024 ] ],

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
