# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# Model Summary: 247 layers, 6441303 parameters, 0 gradients, 15.422414 GFLOPs
# runs/train/bottle_source_ResNet_SE/weights/best.pt
#Class     Images     Labels          P          R     mAP@.5 mAP@.5:.95: 100%|██████████| 10/10 [00:12<00:00,  1.20s/it]
#                 all        335        601      0.785      0.752      0.773      0.499
#                   0        335        182      0.709      0.632      0.649      0.292
#                   1        335         71      0.831      0.764      0.798      0.439
#                   2        335         66      0.705      0.621      0.697      0.231
#                   3        335         45      0.972          1      0.995      0.856
#                   4        335         54      0.845      0.807      0.833      0.318
#                   5        335         18      0.746      0.833      0.895      0.829
#                   6        335         43      0.583      0.605       0.62      0.259
#                   7        335         50      0.578       0.38      0.329      0.145
#                   8        335         48      0.948      0.958      0.981      0.799
#                   9        335         24      0.934      0.917      0.938      0.817
#Speed: 0.2ms pre-process, 3.9ms inference, 1.5ms NMS per image at shape (34, 3, 768, 768)
# runs/train/bottle_source_ResNet_SE3/weights/best.pt 0.782      0.496
# runs/train/bottle_source_ResNet_SE4/weights/best.pt 0.785      0.501
# runs/train/bottle_source_ResNet_SE5/weights/best.pt 0.759      0.493
# runs/train/bottle_source_ResNet_SE6/weights/best.pt 0.759       0.49

# Model Summary: 247 layers, 6441303 parameters, 0 gradients, 15.422414 GFLOPs
# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3_ResNet, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3_ResNet, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3_ResNet, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3_ResNet_SE, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3_ResNet_SE, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3_ResNet, [256, False]],  # 17 (P3/8-small)
#   [ -1, 1, CoTAttention, [ 256 ] ], # 18

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3_ResNet, [512, False]],  # 21 (P4/16-medium)
#   [ -1, 1, CoTAttention, [ 512 ] ],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3_ResNet, [1024, False]],  # 25 (P5/32-large)
#   [ -1, 1, CoTAttention, [ 1024 ] ],

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
