# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
#                  all        335        601      0.793       0.78      0.795      0.498
#                   0        335        182      0.737       0.67      0.699      0.318
#                   1        335         71      0.857      0.761      0.799      0.419
#                   2        335         66      0.695      0.657      0.653      0.225
#                   3        335         45      0.976          1      0.995      0.838
#                   4        335         54      0.805      0.767       0.82      0.286
#                   5        335         18      0.862      0.833       0.93      0.828
#                   6        335         43      0.541      0.712      0.677      0.329
#                   7        335         50      0.591      0.579      0.534      0.212
#                   8        335         48      0.907      0.958      0.924      0.742
#                   9        335         24      0.954      0.864      0.919      0.786
#Speed: 2.0ms pre-process, 13.4ms inference, 2.4ms NMS per image at shape (34, 3, 768, 768)
# runs/train/bottle_source_SE_CoT7/weights/best.pt
# Model Summary: 248 layers, 9961895 parameters, 0 gradients, 20.952206 GFLOPs
# Parameters
nc: 4  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3_SE, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3_SE, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)
   [ -1, 1, CoTAttention, [ 256 ] ], # 18

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 21 (P4/16-medium)
   [ -1, 1, CoTAttention, [ 512 ] ],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 25 (P5/32-large)
   [ -1, 1, CoTAttention, [ 1024 ] ],

   [[18, 22, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
