# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# Model Summary: 213 layers, 7037095 parameters, 0 gradients, 15.879514 GFLOPs
# models/bottle/paper/bottle_yolov5s/weights/best.pt
#Class     Images     Labels          P          R     mAP@.5 mAP@.5:.95: 100%|██████████| 10/10 [00:11<00:00,  1.12s/it]
#                 all        335        601      0.772      0.741      0.752      0.471
#                   0        335        182      0.689      0.633      0.623       0.24
#                   1        335         71      0.767      0.741      0.736      0.381
#                   2        335         66      0.645      0.634      0.674       0.23
#                   3        335         45      0.977          1      0.995      0.845
#                   4        335         54      0.738      0.722      0.775      0.316
#                   5        335         18      0.846      0.889      0.932      0.837
#                   6        335         43      0.624      0.579      0.602      0.231
#                   7        335         50      0.592       0.38      0.299      0.105
#                   8        335         48      0.916      0.958      0.966      0.765
#                   9        335         24      0.929      0.875      0.914       0.76
#Speed: 0.2ms pre-process, 3.3ms inference, 3.6ms NMS per image at shape (34, 3, 768, 768)
# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
